{
    "id": "Bugzilla",
    "titleSection": {
        "name": "Bugzilla",
        "shortDescription": "Server software designed to help you manage software development",
        "pricing": "Free",
        "support": {
            "text": "VersionOne",
            "href": "http://support.versionone.com/home"
        }
    },
    "descriptionSection": {
        "description": "Bugzilla is typically used for defect management. Defect management is the process of recognizing, investigating, taking action and disposing of defects. It involves recording defects, classifying them, and identifying impacts. Defect management tools are also known as bug trackers or issue trackers. VersionOne's 2013 Agile Survey reported that 83% of respondents currently use a bug tracker. In the agile world, use of a defect management tool separate from an agile project management tool is typical for new agile teams where testers have not yet been fully integrated into the team.\n\nIntegrating VersionOne with Bugzilla is most useful in the following cases:\n\n* Your agile team is working with a legacy product with long backlog of defects from development prior to going agile.\n* Your agile team is involved in frequent communication with support engineers who are accustomed to communicating with developers via Bugzilla.\n* Your agile team will be expected to work with a siloed test organization that is not yet agile and is accustomed to communicating with developers via Bugzilla.\n\nUnder these circumstances, VersionOne recommends implementing a triage process. The Product Owner should work with developers, testing, and support, to review old and new defects and to decide which ones to bring into the agile planning process. It is important not to flood the backlog with too many defects. When the backlog is too long, it becomes impossible to effectively prioritize. It is also important not to accept defects that do not yet have sufficient detail and shared understanding. Defects often need research and discussion with customers before they are ready to be worked. This process helps a Product Owner balance new work and maintenance.\n\nWhen integrating VersionOne and Bugzilla, your agile team should not expect to just drop-in-and-go. Your team and stakeholders should expect some minor workflow and tool changes to adapt the whole system to agile practices. That said, integration is a good way to leverage many existing automated workflows and defect reporting, while adding the practice of agile project management."
    },
    "linksSection": [
        {
            "type": "hyperlink",
            "title": "OpsHub Integration Manager for VersionOne and Bugzilla Integration",
            "href": "http://v1appcatalog.azurewebsites.net/app/index.html#/Details/OpsHub.VersionOne.Bugzilla"
        },
        {
            "type": "hyperlink",
            "title": "Tasktop Sync for VersionOne and Bugzilla Integration",
            "href": "http://v1appcatalog.azurewebsites.net/app/index.html#/Details/Tasktop.Sync.VersionOne.Bugzilla"
        },
        {
            "type": "hyperlink",
            "title": "VersionOne Integration for Bugzilla",
            "href": "http://v1appcatalog.azurewebsites.net/app/index.html#/Details/VersionOne.Integration.Bugzilla"
        }
    ],
    "updatesSection": {
        "updates": [
            {
                "date": "2014-04-02T00:00:00.000Z",
                "description": "Tasktop released Tasktop Sync 3.5",
                "version": "3.5",
                "qualityBand": "product"
            },            
            {
                "date": "2013-03-20T00:00:00.000Z",
                "description": "OpsHub released OpsHub Integration Manager 5.3",
                "version": "5.3",
                "qualityBand": "product"
            },
            {
                "date": "2012-05-15T00:00:00.000Z",
                "description": "VersionOne released an update to the open-source integration",
                "version": "8.3.2042",
                "qualityBand": "product"
            }
        ],
        "qualityBands": {
            "product": {
                "shortDescription": "This product is described in another entry."
            }            
        }
    }    
}