{
    "id": "QASymphony.qTestExplorer.VersionOne",
    "titleSection": {
        "name": "QASymphony qTest eXplorer Integration for VersionOne",
        "shortDescription": "Create new defects and share detailed steps to reproduce.",
        "pricing": "Free with qTest Enterprise",
        "support": {
            "text": "QASymphony",
            "href": "http://support.qasymphony.com/home"
        }
    },
    "descriptionSection": {
        "description": "qTest eXplorer is an intelligent screen capture tool that runs unobtrusively on a testers' desktop, capturing every screen and step needed to reproduce a defect. The session can then be submitted to VersionOne directly as a defect, synced into the Session Manager of qTest, or saved locally as one of several popular formats. Additionally, users can convert the recorded sessions into a manual scripted test case for later use in regression or integration testing cycles.\n\n##Benefits\n\nqTest eXplorer allows for quick and seamless submission of detailed defect records into VersionOne. This simplified submission process will save testers time usually spent documenting, allowing them more time to find critical value added bugs that will increase software quality. qTest eXplorer is the leading exploratory testing tool, allowing for complete screen capture of exploratory testing sessions across desktop and mobile platforms. qTest eXplorer’s integration with qTest provides a platform for managing the progress of test sessions performed and the ability to edit sessions and submit defects from those sessions directly from qTest’s interface."
    },
    "linksSection": [
        {
            "type": "hyperlink",
            "title": "About qTest eXplorer",
            "href": "http://www.qasymphony.com/platform/exploratory-testing.html"
        },
        {
            "type": "hyperlink",
            "title": "Integration Annoucement",
            "href": "http://www.qasymphony.com/qasymphony-to-partner-with-versionone-to-help-teams-speed-agile-adoption-via-qa-collaboration.html"
        }
    ],
    "updatesSection": {
        "updates": [
            {
                "date": "2014-10-13T00:00:00.000Z",
                "description": "Fall 2014\n\n* Changed product name from qTrace to qTest eXplorer",
                "version": "2014",
                "qualityBand": "commercial"
            },		
            {
                "date": "2012-08-13T00:00:00.000Z",
                "description": "Summer 2012",
                "version": "2012",
                "qualityBand": "commercial"
            }
        ],
        "qualityBands": {
            "commercial": {
                "shortDescription": "The product is stable and supported."
            }
        }
    }
}