{
    "id": "VersionOne.Integration.Buy-A-Feature",
    "titleSection": {
        "name": "VersionOne Integration for Buy A Feature",
        "shortDescription": "helps product planners collaborate with customers to better understand and prioritize their backlog.",
        "pricing": "Free",
        "support": {
            "text": "VersionOne",
            "href": "http://support.versionone.com/home"
        }
    },
    "descriptionSection": {
        "description": "## Solving the Hard Problems in Agile Software Development\nThe integration of Innovation Games Online with VersionOne's industry-leading Agile Management tool enables VersionOne customers to use the Innovation Game Buy a Feature Online to solve one of the hardest problems in agile software development: Determining the priority of user stories with customers and stakeholders.\n## The Problem\nIt's easy to fall into the trap of thinking that customers and stakeholders have clearly defined product priorities. Some do. Most don't. When presented with a set of options, many customers will simply say \"I want them all\" and put the responsibility for prioritizing their requests on the shoulders of product planners. Alternatively, product managers often gather feature priorities by working with customers one-on-one and, in the process, and perhaps without even realizing it, again take responsibility for prioritizing features.\n## The Solution\nInnovation Games' virtual market game Buy a Feature Online circumvents these issues by enabling customers and stakeholders to prioritize their desires as a group. The game encourages negotiation and discussion, which in addition to the game results enhances your understanding of what your customers really want.\nIn the integration with VersionOne, VersionOne users select user stories and export them into Buy a Feature Online. They then play Buy a Feature with customers or internal stakeholders to prioritize these stories. When finished, the system automatically imports the results back into VersionOne's platform. The solution provides for all of the advantage of real-time, interactive, collaborative games—without the added cost or complexity of bringing participants physically together."
    },
    "linksSection": [
        {
            "type": "download",
            "title": "Download Latest Stable Build",
            "href": "http://platform.versionone.com.s3.amazonaws.com/downloads/V1BuyAFeatureIntegration.8.3.zip"
        },
        {
            "type": "documentation",
            "title": "Documentation",
            "href": "http://versionone.github.io/VersionOne.Integration.Buy-A-Feature/"
        },
        {
            "type": "hyperlink",
            "title": "More about Buy a Feature",
            "href": "http://innovationgames.com/buy-a-feature/"
        }        
    ],
    "updatesSection": {
        "updates": [
            {
                "date": "2011-12-01T00:00:00.000Z",
                "description": "Winter 2011",
                "version": "8.3.0.1994",
                "releaseNotes": " * New: Create Buy-a-Feature Online Game Definition from Feature Group (Theme) \n * New: Create Buy-a-Feature Online Game Items from Backlog Items (Stories) \n * New: Report summary game results from Buy-a-Feature Online to VersionOne",
                "qualityBand": "mature",
                "downloadUrl": "http://platform.versionone.com.s3.amazonaws.com/downloads/V1BuyAFeatureIntegration.8.3.zip"
            }
        ],
        "qualityBands": {
            "seed": {
                "shortDescription": "The initial idea of a product. May not be stable code.",
                "href": "https://github.com/versionone/VersionOne.Integration.Buy-A-Feature/blob/master/CONTRIBUTING.md#seed"
            },
            "sapling": {
                "shortDescription": "The product is undergoing rapid growth. The code works but expect major changes.",
                "href": "https://github.com/versionone/VersionOne.Integration.Buy-A-Feature/blob/master/CONTRIBUTING.md#sapling"
            },
            "mature": {
                "shortDescription": "The product is stable. The code will continue to evolve with minimum breaking changes.",
                "href": "https://github.com/versionone/VersionOne.Integration.Buy-A-Feature/blob/master/CONTRIBUTING.md#mature"
            }
        }
    },
    "mediaSection": [
        {
            "title": "Using VersionOne and Buy a Feature",
            "caption": "Quickly and easily export user stories into Buy a Feature Online, play the game and import the prioritized results back into VersionOne",
            "mimetype": "video/x-flv",
            "href": "http://www.versionone.tv.s3.amazonaws.com/BuyAFeature/BuyAFeature.flv",
            "thumbhref": "http://legacy.community.versionone.com/attachments/imagefolder/gettingstarted/video.png"
        }
    ]
}